OdDAI.DefinedType.#ctor(OdDAI.Schema*,OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSharedPtr&lt;OdTypeCode&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdSmartPtr&lt;OdDAI.UnderlyingType&gt;)
\details
Creates a new defined type object with specified parameters.
\param parentSchema [in] A raw pointer to a schema in which defined type is declared.
\param name         [in] A name of the defined type.
\param typeCode     [in] A smart pointer to a type code of defined type.
\param domain       [in] A smart pointer to an underlying type of defined type.